In [1]:
import pandas as pd
import numpy as np
import io

In [3]:
data=pd.read_csv("sample.csv")

In [4]:
data

   Sl.no    name qualification        mobile     address
0      0  Ananya           MCA  8.974654e+09        crus
1      1    Biya           MBA  8.795133e+09       jshfj
2      2   Chaya           MEC           NaN  kjhsdjuhuj
3      3    Diya           CSE  8.974654e+09        jhbj
4      4    Isha         Btech  8.974654e+09     kjshdfj
5      5    Miya          MCOM           NaN         sfc
6      6    Niya            MA  8.974654e+09         sfc
7      7    Siya           NaN  8.974054e+09        dfsf
8      8    Piya           NaN  9.844654e+09         NaN
9      9    Tiya           Bsc  8.974634e+09         NaN

In [5]:
data.head(5)

   Sl.no    name qualification        mobile     address
0      0  Ananya           MCA  8.974654e+09        crus
1      1    Biya           MBA  8.795133e+09       jshfj
2      2   Chaya           MEC           NaN  kjhsdjuhuj
3      3    Diya           CSE  8.974654e+09        jhbj
4      4    Isha         Btech  8.974654e+09     kjshdfj

In [6]:
data.drop_duplicates(subset=["name"],keep="last",inplace=True)

In [7]:
data

   Sl.no    name qualification        mobile     address
0      0  Ananya           MCA  8.974654e+09        crus
1      1    Biya           MBA  8.795133e+09       jshfj
2      2   Chaya           MEC           NaN  kjhsdjuhuj
3      3    Diya           CSE  8.974654e+09        jhbj
4      4    Isha         Btech  8.974654e+09     kjshdfj
5      5    Miya          MCOM           NaN         sfc
6      6    Niya            MA  8.974654e+09         sfc
7      7    Siya           NaN  8.974054e+09        dfsf
8      8    Piya           NaN  9.844654e+09         NaN
9      9    Tiya           Bsc  8.974634e+09         NaN

In [8]:
data.isnull().sum()

Sl.no            0
name             0
qualification    2
mobile           2
address          2
dtype: int64

In [11]:
data_dropped=data.dropna()

In [13]:
data.head()

   Sl.no    name qualification        mobile     address
0      0  Ananya           MCA  8.974654e+09        crus
1      1    Biya           MBA  8.795133e+09       jshfj
2      2   Chaya           MEC           NaN  kjhsdjuhuj
3      3    Diya           CSE  8.974654e+09        jhbj
4      4    Isha         Btech  8.974654e+09     kjshdfj

In [14]:
data.isnull().sum()

Sl.no            0
name             0
qualification    2
mobile           2
address          2
dtype: int64

In [16]:
data['address']=data['address'].fillna("sullia")

In [17]:
data

   Sl.no    name qualification        mobile     address
0      0  Ananya           MCA  8.974654e+09        crus
1      1    Biya           MBA  8.795133e+09       jshfj
2      2   Chaya           MEC           NaN  kjhsdjuhuj
3      3    Diya           CSE  8.974654e+09        jhbj
4      4    Isha         Btech  8.974654e+09     kjshdfj
5      5    Miya          MCOM           NaN         sfc
6      6    Niya            MA  8.974654e+09         sfc
7      7    Siya           NaN  8.974054e+09        dfsf
8      8    Piya           NaN  9.844654e+09      sullia
9      9    Tiya           Bsc  8.974634e+09      sullia

In [18]:
data.isnull().sum()

Sl.no            0
name             0
qualification    2
mobile           2
address          0
dtype: int64

In [19]:
array=np.array([[1,1,1],[2,3,4],[4,5,6],])

In [20]:
index_values=['row1','row2','row3']

In [21]:
column_values=['col1','col2','col3']

In [22]:
df=pd.DataFrame(data=array,index=index_values,columns=column_values)

In [23]:
print(df)

      col1  col2  col3
row1     1     1     1
row2     2     3     4
row3     4     5     6

In [24]:
df

      col1  col2  col3
row1     1     1     1
row2     2     3     4
row3     4     5     6

In [25]:
trace = np.trace(df)

In [27]:
print("trasce of the matrix",trace)

trasce of the matrix 10